Revit 2024 API
Wood Class
 A static class that provides access to the property names that appear in the Wood visual asset schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static class Wood
Visual Basic
Public NotInheritable Class Wood
Visual C++
public ref class Wood abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Visual.Wood
See Also
Wood Members
Autodesk.Revit.DB.Visual Namespace